while True:
    dic_t_h = {'A':10,'B':11,'C':12,'D':13,'E':14,'F':15}
    x = list(input("Введите первое шестнадцатиричное число "))
    y = list(input("Введите первое шестнадцатиричное число "))
    z = input("Введите знак +, * ( 0 для выхода) ")

    if z=='0':
        break
    elif z == '+':
        print('Сумма равна ', (hex(int(''.join(x),16) + int(''.join(y),16)))[2:])
    elif z== "*":
        print('Произведение равно ', (hex(int(''.join(x),16) * int(''.join(y),16)))[2:])
    else:
        print('Ошибка значение')